Revit 2027 API
IFCParameterTemplate.ListNames Method
 Returns a list of names of IFC export parameter mapping templates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<string> ListNames(
	Document document
)
Public Shared Function ListNames (
	document As Document
) As IList(Of String)
public:
static IList<String^>^ ListNames(
	Document^ document
)
static member ListNames :
        document : Document -> IList<string>
Parameters
document Document
 The Revit document to retrieve names from.
Return Value
IList<String>
 The array of strings representing names of predefined setups.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace